import telebot

bot = telebot.TeleBot('7679210251:AAGarIQr6q4-OQhYeinlTd8SID2jbAZKxn8')
recommendations = {
    'холодно': '(температура від 0°C до +10°C) : Я б вам порекомендував одягнути теплі джинси або термобілизну під штани, щоб зберегти тепло. Виберіть теплу куртку або пальто з утеплювачем, наприклад, пуховик або дублянку, а також не забудьте взяти теплі рукавички та шапку. Черевики або чоботи з утепленою підошвою та водонепроникним покриттям стануть ідеальним варіантом для таких холодних днів , але краще посидіти в дома!.',
    'прохолодно': '(температура від +10°C до +15°C): Вам підійде легка зимова куртка або парка, а також можна вибрати вітровку для захисту від прохолодного вітру. Теплі джинси або брюки будуть хорошим вибором для цього типу погоди. Взуття — черевики або кросівки, які не пропускають холод. Шапка та шарф допоможуть зберегти комфорт, а якщо температура падає до нижчої межі, додайте рукавички для тепла.',
    'тепло': '(температура від +15°C до +20°C): Я б порадив одягти легку куртку або джинсовку для прохолодних моментів, коли вітер або вечір може бути трішки холодним. Легкі джинси або брюки, а для більш теплих умов — шорти, футболка або легка сорочка стануть чудовим вибором. Взуття — зручні кросівки або мокасини, щоб комфортно почуватися в таку погоду. Сонцезахисні окуляри і капелюх не завадять, якщо на вулиці сонячно!',
    'дуже тепло': '(температура вище +25°C): Вам варто одягнути легку футболку або майку, шорти, лляні брюки або легке плаття, якщо хочете зберігати комфорт. Вибирайте легке взуття: сандалі, шльопанці чи кеди. Не забувайте взяти з собою сонцезахисні окуляри та капелюх, щоб захистити голову від сонця. Сонцезахисний крем також стане в пригоді, особливо в таку жарку погоду!',
    'дощово': '(осіній час): В будь-якому випадку вам краще одягнути дощовик або водонепроникну куртку, аби залишатися сухим. Вибирайте водонепроникні черевики або чоботи, щоб не промокнути під час дощу. Якщо не хочете замокнути, не забудьте взяти парасольку. Якщо на вулиці холодно, додайте термобілизну або теплі штани. У будь-якому разі, головне — не забути захист від води!',
    'сніжно': ' (зимовий час): Я б вам порадив одягнути утеплений пуховик або зимову куртку, а також термобілизну, щоб не замерзнути. Виберіть утеплені штани або комбінезон. Сніг може бути холодним, тому вам точно знадобляться зимові черевики з водонепроникним покриттям. Не забувайте про теплі рукавички, шапку та шарф — вони захистять вас від холоду. А якщо буде особливо холодно, додайте флісові шкарпетки для додаткового тепла.'
}

@bot.message_handler(commands=['start'])
def main(message):
    bot.reply_to(message, "Привіт друже! Я можу дати рекомендацію що до одягу. Напишіть яка зараз погода (наприклад, 'холодно', 'прохолодно', 'тепло', 'дуже тепло', 'дощово', 'сніжно').")

@bot.message_handler(func=lambda message: True)
def send_recommendation(message):
    weather = message.text.lower()
    if weather in recommendations:
        recommendation = recommendations[weather]
    else:
        recommendation = 'Вибачте, я поки не знаю, що порекомендувати для такої погоди, як що вам хочиться щось взнати про погоду то напишіть будьласка.'

    bot.reply_to(message, recommendation)

bot.polling(non_stop=True)