import telebot
from help import key
bot = telebot.TeleBot("7679210251:AAGarIQr6q4-OQhYeinlTd8SID2jbAZKxn8")
@bot.message_handler(commands=['wether'])
def main(message):
    number = key()  # Отримуємо температуру з help.py
    bot.reply_to(message, text=f'Зараз на вулиці температура: {number}°C')

    if 0 <= number < 10:
        bot.reply_to(message, text=f'Холодно (температура {number}) : Я б вам порекомендував одягнути теплі джинси або термобілизну під штани, щоб зберегти тепло. Виберіть теплу куртку або пальто з утеплювачем, наприклад, пуховик або дублянку, а також не забудьте взяти теплі рукавички та шапку. Черевики або чоботи з утепленою підошвою та водонепроникним покриттям стануть ідеальним варіантом для таких холодних днів , але краще посидіти в дома!.')
    elif 10 <= number < 15:
        bot.reply_to(message, text=f'Прохолодно (температура {number} ) : Вам підійде легка зимова куртка або парка, а також можна вибрати вітровку для захисту від прохолодного вітру. Теплі джинси або брюки будуть хорошим вибором для цього типу погоди. Взуття — черевики або кросівки, які не пропускають холод. Шапка та шарф допоможуть зберегти комфорт, а якщо температура падає до нижчої межі, додайте рукавички для тепла.')
    elif 15 <= number < 20:
        bot.reply_to(message, text=f'Тепло (температура {number} ) : Я б порадив одягти легку куртку або джинсовку для прохолодних моментів, коли вітер або вечір може бути трішки холодним. Легкі джинси або брюки, а для більш теплих умов — шорти, футболка або легка сорочка стануть чудовим вибором. Взуття — зручні кросівки або мокасини, щоб комфортно почуватися в таку погоду. Сонцезахисні окуляри і капелюх не завадять, якщо на вулиці сонячно!')
    elif 20 <= number < 40:
        bot.reply_to(message, text=f'Дуже тепло (температура {number} ) : Вам варто одягнути легку футболку або майку, шорти, лляні брюки або легке плаття, якщо хочете зберігати комфорт. Вибирайте легке взуття: сандалі, шльопанці чи кеди. Не забувайте взяти з собою сонцезахисні окуляри та капелюх, щоб захистити голову від сонця. Сонцезахисний крем також стане в пригоді, особливо в таку жарку погоду!')
    elif -10 <= number < 0:
        bot.reply_to(message, text=f'Морозно (температура {number} ) : Я б вам порадив одягнути теплу зимову куртку або пуховик, щоб захиститися від холоду. Додайте термобілизну під джинси або виберіть утеплені штани. На ноги — зимові чоботи або черевики з утепленням і водонепроникною підошвою. Не забудьте надіти теплі рукавички, шапку і шарф, щоб зігрітися. А для додаткового тепла можна взяти флісовий светр.')
    elif number < -19:
        bot.reply_to(message, text=f"Дуже холодно (температура {number} ) : В таку погоду краще надягати кілька шарів одягу: термобілизна, теплий светр або фліска, а зверху зимова куртка або парка. Штани повинні бути утепленими, або носіть термобілизну під звичайні джинси. Зимові чоботи з хутром — ідеальний варіант. Не забудьте про теплі вовняні шкарпетки. На голову обов'язково одягніть теплу шапку, закрийте обличчя шарфом або бафом, і додайте рукавички або навіть рукавиці.")
    elif number < -40:
        bot.reply_to(message, text= f"Екстремально холодно (температура {number} ) : При такій температурі важливо ретельно утеплюватися. Надягніть термобілизну, теплий светр або фліску, а зверху — дуже теплу зимову куртку з капюшоном. Штани повинні бути максимально утепленими, або використовуйте комбінезон. На ноги — тільки зимові чоботи з товстим шаром утеплювача і двоє шкарпеток (одні тонкі, інші — вовняні). Обов'язково носіть рукавиці (краще тепліші, ніж рукавички), теплу шапку, закривайте обличчя шарфом, бафом або балаклавою, щоб уникнути обмороження. Якщо є можливість, використовуйте грілки для рук та ніг.")


bot.polling(non_stop=True)
